/*
Перша цифра мінімальна затримка друга максимальна в секундах.
*/
const DELAY = [60, 120];

/*
Номери акаунтів які будуть проганятися.
Відправка транзакцій здійснється в тому порядку в якому вказано.
Нумерація починається з нуля. Номери відповідають порядку мнемонічних слів в файлі mnemonic.js
*/
const ACC_NUMBERS = [10, 2, 4, 11];

/*
Максимальний газ в $ за транзакцію.
Якщо газ буде більший скрипт буде очікувати і кожну хвилину перевіряти чи газ допустимий.
*/
const ALLOWED_FEE = 0.1;

module.exports = {
  DELAY,
  ACC_NUMBERS,
  ALLOWED_FEE,
};
