/*
Затримка перед наступним акаунтом
Перша цифра мінімальна затримка друга максимальна в секундах.
*/
const DELAY_ACC = [100, 220];

/*
Затримка між транзакціями.
Перша цифра мінімальна затримка друга максимальна в секундах.
*/
const DELAY_TX = [60, 30];

/*
Максимальна кільскість транзакцій для одного акаунта
Буде вибрано рандомна кількість між 1 і TX_AMNT
*/
const TX_AMNT = 4;

/*
Номери акаунтів які будуть проганятися.
Відправка транзакцій здійснється в тому порядку в якому вказано.
Нумерація починається з нуля. Номери відповідають порядку мнемонічних слів в файлі mnemonic.js
*/
const ACC_NUMBERS = [
  16, 25, 4, 10, 45, 30, 12, 20, 32, 15, 14, 42, 40, 13, 6, 19, 43, 18, 8, 48, 7, 53, 33, 3, 9, 36,
  55, 54, 23, 49, 39, 21, 34, 31, 29, 11, 47, 50, 5, 52, 24, 44, 2, 41, 22, 51, 46, 1, 28, 27, 0,
  26, 17, 35, 38, 37,
];

/*
Максимальний газ в $ за транзакцію.
Якщо газ буде більший скрипт буде очікувати і кожну хвилину перевіряти чи газ допустимий.
*/
const ALLOWED_FEE = 0.17;

/*
0 - дані кошелька будуть зчитуватися з js файла wallet_data.config.js
1 - дані кошелька будуть зчитуватися з xlsx файла wallet_data.config.xlsx (за питаннями в тг)
*/
const READ_DATA_TYPE = 1;

module.exports = {
  DELAY_ACC,
  DELAY_TX,
  TX_AMNT,
  ACC_NUMBERS,
  ALLOWED_FEE,
  READ_DATA_TYPE,
};
